<div class="alert alert-block alert-info">
<center>ESTATÍSTICA APLICADA</center>
<center>
ALUNO: Wesley Wilson Almeida Araújo</center>
</div>

<div class="alert alert-block alert-info">
Questão 1. Considere as tabelas de vendas diárias de três lojas.

Crie dois novos dataframes por meio da junção dos três acima, agrupando, para isso, os dataframes no sentido de linha para criar um, e no sentido de coluna para criar o segundo. Explique as diferenças entre as duas saídas, principalmente a ocorrência de valores NaN.
</div>

In [13]:
import pandas as pd
Mercearia = pd.DataFrame({"loja":["A", "A", "A"],
                          "dia": ["sex", "sab", "dom"],
                          "valor": [7500, 9500, 8200]})
Farmácia = pd.DataFrame({"loja":["B", "B", "B"],
                         "dia": ["sex", "sab", "dom"],
                         "valor": [5100, 8250, 9900]})
Restaurante = pd.DataFrame({"loja":["C", "C"],
                            "dia": ["sab", "dom"],
                            "valor": [7500, 11800]})

In [14]:
p = pd.concat([Mercearia, Farmácia, Restaurante], ignore_index=True)
p

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
3    B  sex   5100
4    B  sab   8250
5    B  dom   9900
6    C  sab   7500
7    C  dom  11800

In [15]:
q = pd.concat([Mercearia, Farmácia, Restaurante], axis = 1)
q

  loja  dia  valor loja  dia  valor loja  dia    valor
0    A  sex   7500    B  sex   5100    C  sab   7500.0
1    A  sab   9500    B  sab   8250    C  dom  11800.0
2    A  dom   8200    B  dom   9900  NaN  NaN      NaN

No primeiro dataframe, eu usei o concat para juntar os 3 dataframes, assim, por padrão os dataframes vão se juntar criando novas linhas, no segundo dataframe, eu alterei o eixo para 1, indicando a direção que eu queria acrescentar as informações no dataframe, os valores NaN nas 3 últimas colunas se deve ao fato de que o dataframe 'Restaurante' possui apenas 2 linhas e os outros possuem 3 linhas, e como o 'Restaurante' não possui dados no índice 2 aparece o NaN.

<div class="alert alert-block alert-info">
Questão 2. Com base nos dataframes a seguir, que guardam informações de matriculas de alunos
em dois cursos, um de SQL e outro de Python.
responda:
</div>

In [16]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
                             "ecg@acmecorpus.com"]})
PYTHON = pd.DataFrame({"email":["ana@xyz.com",
                                "jonas@acmecorpus.com",
                                "rakesh@xyz.com"]})

(a) quais são os alunos distintos, considerando ambas as listas?

In [17]:
a2 = pd.concat([SQL,PYTHON]).drop_duplicates(keep=False)
a2

                  email
1    ecg@acmecorpus.com
0           ana@xyz.com
1  jonas@acmecorpus.com

(b) quais são os alunos que fizeram ambos os cursos?

In [18]:
b2 = pd.merge(SQL,PYTHON, how='inner')
b2

            email
0  rakesh@xyz.com

(c) quais os alunos que realizaram o curso de SQL, mas não o de PYTHON (e
vice-versa)?

In [19]:
c2 = SQL.merge(PYTHON, how = 'outer' ,indicator=True).loc[lambda x : x['_merge']=='left_only']
c2

                email     _merge
1  ecg@acmecorpus.com  left_only

In [20]:
c22 = SQL.merge(PYTHON, how = 'outer' ,indicator=True).loc[lambda x : x['_merge']=='right_only']
c22

                  email      _merge
2           ana@xyz.com  right_only
3  jonas@acmecorpus.com  right_only

<div class="alert alert-block alert-info">
Questão 3. Considere os dois dataframes a seguir, referentes aos dados sobre os departamentos
e os funcionários de uma empresa.

Combine os dados dos funcionários com os dados dos departamentos para criar um
novo dataframe completo sobre a empresa, usando merge
</div>

In [21]:
dic_emp = {"id":["D1","D2","D3","D4"],
           "nomDepto": ["Compras","RH","TI","Vendas"],
           "local":["SP","RJ","RJ","SP"]
}

dic_func = {"num":[3199,3269,3555,3788,3844],
            "nome": ["Ana","David","José","Marina","Luís"],
            "salario":[1600,2975,1500,5000,3000],
            "idDepto": ["D2","D3",None,"D2","D4"]
}

empresa = pd.DataFrame(dic_emp)
funcionarios = pd.DataFrame(dic_func)

In [22]:
funcionarios = funcionarios.rename(columns={"idDepto":"id"})
q3 = pd.merge(empresa, funcionarios, on="id")
q3

   id nomDepto local   num    nome  salario
0  D2       RH    RJ  3199     Ana     1600
1  D2       RH    RJ  3788  Marina     5000
2  D3       TI    RJ  3269   David     2975
3  D4   Vendas    SP  3844    Luís     3000